'''
Етап «Правила гри»
Використовуй команду print (), щоб привітатися з гравцем і пояснити йому правила гри.

Етап «Питання-відповідь»: генерація задуманого числа
Нехай програма загадає число. Для цього підключи модуль random і використовуй команду randint (a, b), де a і b - межі, в яких потрібно видати випадкове число.

Етап «Питання-відповідь»: введення числа користувачем
Запросіть у користувача його варіант відповіді за допомогою команди input ().

Етап «Питання-відповідь»: підказки
Порівняте за допомогою умовного оператора введене користувачем число з задуманим. Якщо вони не збігаються, виведи підказку, більше загадане число або менше введеного варіанти відповіді.

Етап «Питання-відповідь»: повтор введення
Додате в програму цикл, щоб користувач міг повторно вводити варіант відповіді, поки не відгадає.

Етап «Результат гри»
Привітай користувача з перемогою і виведи на екран загадане число.

Бонус: додате в програму підрахунок спроб!
'''
import random

a = input("Привіт, як вас звуть?: ")
print(a, ', ви попали в гру: "Вгадай число". Тут вам потрібно вводити число, а я буду натякати чи число більше чи менше за потрібне. Ви маєте необмежену кількість спроб. Діапазон гри від -100 до 100')
num = random.randint(-100, 100)
sproba = 0
while True:
    ch = int(input("Введіть свій варіант числа: "))
    sproba += 1
    if ch == num:
        print(f"Вітаю, ви вгадали число {num} за {sproba} спроб.")
        break
    elif ch > num:
        print("Ваше число більше за загадане.")
    elif ch < num:
        print("Ваше число менше за загадане.")
print("Гра завершена. Дякую за участь.")
    