'''
Напишіть калькулятор: програма отримує два числа 
і операцію, здійснює операцію і друкує результат.
Програма виконує такі операції: 
"+" - додавання, 
"-" - відняти від першого числа друге, 
"*" - помножити, 
"/" - розділити перше число на друге. 
Якщо введена якась інша операція, 
потрібно надрукувати рядок, який вказаний у змінній 
err1: "Помилка: невідома операція.
"Якщо введена операція ділення, і друге число дорівнює нулю, 
потрібно надрукувати рядок err2: "Помилка: ділити на нуль не можна."

'''

err1 = "Помилка: невідома операція."
err2 = "Помилка: ділити на нуль не можна."
