'''
Вільний діалог

Вільне завдання: вигадайте свою програму, яка задає питання і коментує відповіді.
Можна, наприклад, написати програму-анкету, яка запитує дані людини: ім'я, прізвище, вік, улюблені колір 
і страву і т. д., а потім друкує табличку типу 
"Ім'я: (ім'я людини)". 
"Прізвище: (введене прізвище)" 
і т. д.            
                                                                                  
А можна придумати смішний діалог. 
Запропонуйте друзям поговорити з цією програмою!
'''


print("Заповныть анкетку")
a = input("Як вас звати? ")
b = input("Скільки вам років? ")
c = input("Який ваш улюблений колір? ")
d = input("Яка ваша улюблена страва? ")


print("Це ваша анкета:")
print("Ім'я:", a)
print("Вік:", b)
print("Улюблений колір:", c)
print("Улюблена страва:", d)